---
kind: property
id: P:Autodesk.Revit.DB.CurveExtents.EndParameter
source: html/e3195cac-ca48-33c5-88bc-64263ee4cb89.htm
---
# Autodesk.Revit.DB.CurveExtents.EndParameter Property

The end parameter of the curve extents.

## Syntax (C#)
```csharp
public double EndParameter { get; }
```